ponies/app/controllers/ponies_controller.rb

SELECT "ponies".* FROM "ponies"
---
  def index
    @ponies = Pony.all

SELECT "ponies".* FROM "ponies"
---
  def new
    @ponies = Pony.all

INSERT INTO "ponies" ("name", "profession", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "pony"], ["profession", "pony"], ["created_at", 2016-12-14 19:18:39 UTC], ["updated_at", 2016-12-14 19:18:39 UTC]]
---
  def create
    @pony = Pony.new(pony_params)

    respond_to do |format|
      if @pony.save

DELETE FROM "ponies" WHERE "ponies"."id" = ?  [["id", 1]]
---
  def destroy
    #@pony = Pony.find(params[:id])
    @pony.destroy

SELECT  "ponies".* FROM "ponies" WHERE "ponies"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def set_pony
      @pony = Pony.find(params[:id])