ponies/app/views/ponies/destroy.js.erb


$('.delete_pony').bind('ajax:success', function() {
	console.log('ajax');
   $(this).closest('tr').fadeOut();
});
---
DELETE FROM "ponies" WHERE "ponies"."id" = ?  [["id", 1]]